def range_ip (start, finish):
    """Принимает старт диапозона и финиш. Генерирует  все IP в диапозоне. Создает и Записывает
    их в Файл.тхт (про запись в фаил временное решение"""
    pass

def port_open(ip):
    """Считывает построчно из файла IP проверяет на открытый порт. Возврат файл с IP
    адресами открытых портов"""
    pass

def parser(ip_port):
    """Принимет IP с открытым портом проверяет на наличие сервера """
    pass

def withe_lest(server_ip):
    """Принимает сервера с IP и портами проверяет конфиг на ВайтЛист, записывает
    в файл с указанием версии"""
    pass
